---
kind: method
id: M:Autodesk.Revit.DB.Options.#ctor(Autodesk.Revit.DB.Options)
source: html/b18b91ea-babe-ba5e-ef3b-a6fb925ae252.htm
---
# Autodesk.Revit.DB.Options.#ctor Method

Copy constructor.

## Syntax (C#)
```csharp
public Options(
	Options pOptions
)
```

## Parameters
- **pOptions** (`Autodesk.Revit.DB.Options`)